# Написати валідації за допомогою регулярних виразів та протестувати
# на рiзних кейсах:
# ﻿- домашній номер телефону (тільки цифри та довжина номера)
#
# - Мобільний номер телефону (тільки цифри, можлива наявність плюса, довжина номера)
#
# - email (наявність @, домену: gmail.com наприклад, мінімальна довжина та
#          максимальна на ваш вибір)
#
# - ПІБ клієнта (3 слова, мінімальна довжина 2 символи, максимальна довжина 20)
#
# додатково:
#
# - Пароль (мінімально: одна велика літера, одна маленька літера, одна цифра,
#           один символ, довжина пароля – від 8 до 16 символів)